tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "kamillobinski/thock"
tap "notwadegrimridge/brew"
tap "protonpass/tap"
brew "aom"
brew "xz"
brew "awscli"
brew "bash"
brew "bat"
brew "dotnet@8", link: true
brew "dotnet@9"
brew "dust"
brew "ffmpeg"
brew "fzf"
brew "forgit"
brew "fswatch"
brew "jpeg-xl"
brew "gh"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "gnuplot"
brew "graphviz"
brew "hashcat"
brew "imagemagick"
brew "john-jumbo"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "llvm"
brew "nmap"
brew "nvm"
brew "openvino"
brew "p7zip"
brew "pipx"
brew "poppler"
brew "pyenv"
brew "python-tk@3.12"
brew "ripgrep"
brew "tailspin"
brew "unison"
brew "uv"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
cask "kamillobinski/thock/thock"
brew "protonpass/tap/pass-cli"
cask "font-monaspace"
cask "ghostty"
cask "notwadegrimridge/brew/pingplace"
vscode "1yib.rust-bundle"
vscode "anthropic.claude-code"
vscode "arcanis.vscode-zipfs"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dustypomerleau.rust-syntax"
vscode "everettjf.filter-line"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "msrvida.vscode-sanddance"
vscode "rust-lang.rust-analyzer"
vscode "tobias-faller.vt100-syntax-highlighting"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
cargo "flamegraph"
cargo "samply"
cargo "tauri-cli"
